export const ContractNames = {};
(function(types) {
  types[(types[1] = '投资须知')] = 1;
  types[(types[2] = '风险提醒书')] = 2;
})(ContractNames);

export const Contracts = {
  1: `《 投资须知 》\n
   1、 在进行产品投资前，投资者应确保自身属于中华人民共和国法律法规规定（不含外籍、港澳台）可以进行投资的投资者，并完全理解产品的性质和风险。\n
   2、 所售产品非银行存款和金融机构发售的理财计划，并且不保证投资金额本金和预期收益，投资者的投资本金和预期收益有可能会因市场变动等原因蒙受损失。投资有可能因为超过或未达到募集规模、不满足服务方四川联创利民科技有限公司（“狗狗金融”）业务规则等原因导致认购失败，将对投资者的投资金额进行无息退款（不含活动赠送的投资本金）。\n
   3、 在募集期内投资后不能申请退款、投资成功后未到期不能申请提前赎回、到期回款划转期内不计息，产品计息为起息日（含）至到期日（不含）。\n
   4、 在产品存续期内，如因国家法律法规、监管规定发生变化，在最大可能不损害投资者利益的前提下，服务方四川联创利明科技有限公司（“狗狗金融”）有权单方对产品进行修订，并通知投资者。\n
   5、 在进行投资之前，投资者需完全理解相关交易协议，了解在线签署电子协议与在纸质上签名具有同等法律效力。若投资者不认同相关协议当中任何条款，不得点击签署协议或进行投资。\n
   6、 投资者完全理解产品相关页面展示的内容，认同并接受相关协议条款和描述，自愿投资并愿意承担各种风险和损失。《投资须知》为投资协议不可分割的组成部分，与协议具有同等法律效力。`,
  2: `《风险提醒书》\n
   尊敬的狗狗金融（GOGO Finance）用户:
   由于本项目受市场、政策、法律等各种因素的影响，狗狗金融为综合金融服务平台，不向本项目提供任何形式的担保，不承诺保本付息，无论是明示或暗示的。狗狗金融提供的各种信息及资料仅供参考，不构成任何投资建议或引导，投资人应依其独立判断做出决策并承担由此带来的投资风险。
   因此请您在投资本项目时，对项目风险务必要有清醒的认识，并根据自身的风险承受能力及资产情况、收入状况、风险偏好等，结合以往的投资经验综合考虑是否投资本项目。
   包括但不限于以下风险:\n
   一、资金出借有风险，出借人(用户) 应充分认识以下风险，谨慎做出决定:
   1、政策风险: 因宏观政策、财政政策、货币政策、行业政策、地区发展政策等因素引起的风险。
   2、信息风险：是指在项目运作过程中，因信息中介方的知识、经验、判断等会影响其对获取的信息的判断。若信息中介方获取的信息不够全面、  准确将可能导致投资人判断有误，从而影响最终的投资收益。息中介方获取的信息不够全面、准确将可能导致投资人判断有误，从而影响最终的投资收益。
   3、借款人信用风险: 资金出借期间，借款人可能因自身原因或外部原因导致短期或长期丧失还款能力，从而导致借款人的还款意愿发生改变，致使出借人的出借资金可能无法按时回收。
   4、市场调控风险: 本APP的借款项目目前符合国家法律法规有关规定，符合行业协会的基本要求。但国家宏观政策以及市场相关法规政策有可能发生变化，这些调整有可能会影响到项目的收益。
   5、违约风险：是指项目融资方因死亡、失踪、停业、解散、撤销、破产，或者被有关监管机构撤销相关业务许可等原因导致不能按时履行还款职责的风险。
   6、技术风险：是指因本项目通过互联网信息技术平台进行信息撮合成交，因此可能存在信息技术系统故障的风险。
   7、操作风险：是指相关人员在业务操作过程中，因操作失误或操作不规范而引起的风险。
   8、不可抗力风险：是指遭受无法预见、无法克服、无法避免等不可抗力的客观情况所导致的项目无法按时还款的风险，包括但不限于洪水、地震及其它自然灾害、战争、骚乱、火灾、突发性公共卫生事件、政府征用、没收、法律法规变化或其他突发事件、项目相关方非正常的暂停或终止业务等。\n
   二、用户为出借人，不得从事以下行为或存在以下情形:
   1、向网络借贷信息中介机构提供不真实、不准确、不完整的信息;
   2、使用非法资金或非自有资金进行出借;
   3、不具备与进行网络借贷活动相适应的风险认知和承受能力，加入与自身风险承受能力不匹配的借款项目;
   4、其他借款服务协议及有关协议约定的禁止性行为。\n
   三、用户应确认具备与参与网络借贷活动相适应的风险意识、风险识别能力、拥有非保本类金融产品投资的经历并熟悉互联网，承诺自行承担借贷产生的本息损失。\n
   用户在做出出借决定、签署各项协议之前应认真阅读本风险提示书，并认真阅读网站内各项协议以及公布的各项规则的全部内容; 同时，用户需要了解相关借款项目的基本情况、风险与收益状况。如有任何疑问，用户应向本网站或者其他权威机构进行咨询及寻求解释。用户应仅在确认其具有识别及承担相关风险能力、确认已从本网站获得令其满意的信息披露、确认拟进行的交易安全符合其本身从事该交易的目的之后，才进行本网站平台上的网络借贷交易。
   用户确认，其同意接受的本风险提示书、签署网站内的相关协议，并在狗狗金融网站上进行网络借贷是用户真实的意思表示。用户承诺,用于出借的全部资金来源合法，不得利用狗狗金福号网站进行信用卡套现、洗钱或其他违法行为，否则应承担全部赔偿责任。
   (用户本人已阅读上述风险提示，充分了解并清楚知晓网络借贷项目的风险，愿意承担相关风险。)\n
   风险提示方: 四川联创利民科技有限公司
  `
};
